{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "batch_input_shape": [null, 64, 64, 3], "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 24, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "beta_constraint": null, "scale": true, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "units": 512}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "units": 2}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "keras_version": "2.0.5"}